{"data":{"markdownRemark":{"html":"<h2 id=\"idea\"><a href=\"#idea\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Idea</h2>\n<p>Eventyr means adventure in Norwegian. And that's exactly the idea behind this: That life is only the memories you make, and the warm relations you create with other people.</p>\n<p>In an attempt at combining people's almost infinite appetite for distractions, and addictions to often seemingly pointless games that in no way affects their lives but give a temporary feeling of achievement, I want to make <strong>life</strong> into a game worth playing, where the objectives are the real objectives of life: Collecting good memories, and creating warm relations. Whilst you may think you're just collecting points in an app, you're really just playing life as an augmented reality game.</p>\n<h2 id=\"how-would-it-work\"><a href=\"#how-would-it-work\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>How would it work?</h2>\n<p>Basically, it's \"Achievements\" brought to real life. Let's say you travel to Paris, and go up the Eiffel Tower. Your phone is your minimap, and can show you all important nearby Achievements. You don't have to do anything, because as soon as you reach the Eiffel Tower, you may get a message like so:\n<code class=\"language-text\">Achievement Unlocked: View from the Top [+85 (+50 Coop. bonus)] [Take photo] [Maybe later]</code></p>\n<p>We don't want to compete with other social networks, instead, it's more like a complementary app that acts as a bridge between your online social life and your real life, allowing you to collect virtual points to motivate you to collect real world experiences. All it does, is give you points for when you visit places or perform actions.</p>\n<h3 id=\"how-does-the-score-system-work\"><a href=\"#how-does-the-score-system-work\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>How does the score system work?</h3>\n<p>Every user has two scores: Personal Points, and Global Points. Personal Points are granted for unverifiable achievements, or personal achievements. For example, Achievements to perform an action (lets say, Achievement: Perform 20 sit-ups) can't be verified with coordinates, and we have no way of verifying a photo even if a photo is used for verification. Therefore, this kind of Achievement only grants Personal points, and they are more for fun than for competition.</p>\n<p>Global Points can get you on top lists, whereas Personal Points cannot. However, if an Achievement that has been completed undergoes a review and is made Global, then of course everyone who has completed this Achievement will have their personal points reduced and their Global Points increased accordingly.</p>\n<hr>\n<h2 id=\"but-more-technically-how-is-this-implemented\"><a href=\"#but-more-technically-how-is-this-implemented\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>But, more technically, how is this implemented?</h2>\n<p>Your phone automatically keeps a local database of your Unlocked, Tracked, and Pinned Achievements. Whenever you have an internet connection, and this data hasn't been updated for a while, the phone sends its current coordinates to the server (and these are <strong><em>never</em></strong> stored on the server! Privacy is an important aspect built-in to this) and receives a list of nearby Achievements.</p>\n<p>The app can then clear out the list of Tracked Achievements and update it with new Tracked Achievements. A Pinned Achievement is an Achievement the user has manually chosen to track, whereas Tracked Achievements happen automatically as you move around in the world. This is how Achievements are unlocked as well. The app only checks the list of Tracked Achievements occasionally, running as a service in the background, and when it finds the user to be moving closer and closer to one of the Tracked Achievements, it increases the frequency to check.</p>\n<p>When a user is within bounds of unlocking the Location Achievement, it becomes unlocked and the user is awarded points according to a simple formula. However, if the user doesn't have wifi or 3G connection, as (s)he may be traveling, the current timestamp, coordinates, Achievement, and so on is added in its local (and ENCRYPTED to avoid tampering) database queue. When a connection is available, all updates made to the users account are sent to the server in order, with their timestamps and signed with a HMAC based on the users secret token.</p>\n<p>Because we never need to store coordinates of users, we can find other users who are nearby, without knowing where they are -- we just know that the two users have many Tracked Achievements in common.</p>\n<h3 id=\"point-calculation\"><a href=\"#point-calculation\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Point calculation</h3>\n<p>Points are granted based on the Category an Achievement belongs to. Every Category has a static amount of points granted to Achievements from that Category. This applies to the Type as well, which also carries some static points with it.</p>\n<p>Finally, there are modes to indicate how complicated an Achievement is to complete.</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Mode</th>\n<th align=\"center\">Multiplier</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\">Easy</td>\n<td align=\"center\">0.5</td>\n</tr>\n<tr>\n<td align=\"left\">Normal</td>\n<td align=\"center\">1.0</td>\n</tr>\n<tr>\n<td align=\"left\">Hard</td>\n<td align=\"center\">1.5</td>\n</tr>\n<tr>\n<td align=\"left\">Nightmare</td>\n<td align=\"center\">2.0</td>\n</tr>\n</tbody>\n</table>\n<p>An Achievement has Base Points, which is the static points granted by the Achievement. The actual points granted is then <code class=\"language-text\">(Achievement Base Points + Category Points + Type Points) * Mode Multiplier</code> and then, additionally, Cooperation Mode points if any. This is also why Personal Achievements need to be reviewed before made public, so that points are aligned fairly.</p>\n<h2 id=\"whats-cooperation-mode\"><a href=\"#whats-cooperation-mode\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>What's Cooperation mode?</h2>\n<p>To counter the common idea that people just stare at their phones and miss out on real life interactions, there's a feature to allow you to request <em>Cooperation</em>, or Coop. Let's say you're sitting at a café in Paris, before you're going to the Eiffel Tower. You wish to earn some extra points (reflected in real life by connecting with new people), so you opt in for Coop. Mode. You can either \"Look for Group\" or invite somebody else who has similar Tracked Achievement's as you.  </p>\n<p>Whenever you unlock an Achievement/Objectives, when the points are calculated and verified officially on the server, it checks if you were linked with somebody else for that Achievement. If you were, and this person completed the same Achievement within 30 minutes of you, you will be awarded a cooperation bonus!</p>\n<p>If you were linked but the other person has not unlocked yet, you will both be granted a coop bonus when the other person unlocks.</p>\n<p>These points start at 85% extra, meaning that the first time you unlock an Achievement with a person, you get 85% extra points. For every time you unlock with the same person, the bonus decreases. It decreases less and less all the time, so you will always get <em>some</em> extra and never reach 0 bonus, but only the first 10-20 times will be a significant bonus. This is to encourage people to coop with <em>new</em> people and not the same friend over and over again. You can still do that, but it's not going to be that beneficial for your score.</p>\n<p>Also, if you're cooperating with more than 1 person, you will receive the highest coop bonus you could be granted. Let's say you're cooperating with 2 others, and one of them you've never cooperated with, whilst the other you've cooperated with 5 times. You will still get the 85% bonus because you always receive the highest coop-bonus.</p>\n<h3 id=\"cooperating-with-friends\"><a href=\"#cooperating-with-friends\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Cooperating with Friends</h3>\n<p>Inspired by the quest given to an Estonian exchange student here last year, who had been given a list of Achievements to unlock before he returned home, it's also possible to create a list of Achievements and share it with other users (or on social media).</p>\n<p>Users can then Pin this list (forced Tracking), and if they complete Achievements within a certain time span of each other, they get a small cooperation bonus. If they don't, they can still see who has pinned this list and keep an eye on the progress of the user.</p>\n<hr>\n<h2 id=\"digging-deeper\"><a href=\"#digging-deeper\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Digging deeper...</h2>\n<p>Alright, I'll try to get a bit more in-depth here ... I may have missed a lot though :(</p>\n<h3 id=\"how-do-users-sign-up\"><a href=\"#how-do-users-sign-up\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>How do users sign up?</h3>\n<p>Users can sign-in with any social network account. As of now, it supports Tumblr, Reddit, Facebook, Twitter, and Google+.</p>\n<h3 id=\"how-are-achievements-created\"><a href=\"#how-are-achievements-created\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>How are Achievements created?</h3>\n<p>Users can create their own Achievements (and if they wish, they can hit \"Request Review\" to make it a global one!), and they can Share their Personal Achievements with others as well. Until it has undergone a review, it will remain Personal.</p>\n<p>Right now, I have just made a script that crawls the web and collects interesting places and their coordinates and turns it into Objectives and Achievements (but the descriptions of these will need to be updated :/).</p>\n<h3 id=\"achievements--their-attributes\"><a href=\"#achievements--their-attributes\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Achievements &#x26; their attributes</h3>\n<p>Achievements come in many shapes and forms, the most common so far being location-based. An Achievement consists mainly of its <em>name</em>, <em>descriptions</em>, and <em>base points</em>. Apart from this, the most important aspects are its <em>Objectives</em>. Objectives are the things that actually have to get done, and an Achievement can consist of 1 or many Objectives that must be completed.</p>\n<p>An Achievement can expire and not be possible to complete after a certain date.</p>\n<h4 id=\"so-what-kind-of-achievements-are-there-only-location\"><a href=\"#so-what-kind-of-achievements-are-there-only-location\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>So, what kind of Achievements are there? Only Location?</h4>\n<p>Nope! There's a few different ones already from the start, and we could continue adding more later on. Right now, these are the different Achievement <strong>types</strong>:</p>\n<ul>\n<li><strong>Location</strong>: Visit a Location to unlock</li>\n<li><strong>Discovery</strong>: Visit multiple Locations to unlock</li>\n<li><strong>Route</strong>: Visit multiple Locations IN ORDER to unlock</li>\n<li><strong>Action</strong>: Perform an action (needs manual unlocking, and grants no <strong>public</strong> points)</li>\n</ul>\n<p>... additions to the ones above are when a time limit is added (i.e must be completed before [date]) or recurring (i.e must be done 5 times in X days)</p>\n<p>Furthermore, an Achievement is just a container for Objectives. Objectives are unlocked, and when all Objectives for an Achievement is unlocked, they grant points and the Achievement becomes unlocked.</p>\n<p>When an Achievement is unlocked, the user can choose to take a photo. This photo has <em>forced</em> geo-tagging, because this is what we need. When the photo is uploaded, it causes a <em>Verification</em> of the Achievement, because we can verify the coordinates embedded in the photo one extra time, even if the request to the server was somehow tampered with. An extra way of verifying the location.</p>\n<p>If the user has opted in for social media sharing, we can post the \"Achievement Unlocked: [name][points]\" along with the photo to each of his/her social media accounts.</p>\n<p>Additionally, Achievements belong to a <strong>Category</strong>, and have a <strong>Mode Multiplier</strong>.</p>\n<h5 id=\"states--relationships\"><a href=\"#states--relationships\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>States &#x26; Relationships</h5>\n<p>An Achievement goes through multiple states in the process. These states are in fact other objects that point to an Achievement, adding some additional information. These states are:</p>\n<ul>\n<li><strong>Dependency</strong>: A link between an Achievement and other Achievements that must be completed first.</li>\n<li><strong>Suggested</strong>: An Achievement in a users \"quest log\" or tracking list, shown on the map by default and regularly checked for progress. These are typically achievements near the users location.</li>\n<li><strong>Favorite</strong>: A special version of Tracked with a flag that this should not be automatically removed when Tracked Achievements are updated. Pinned Achievements are created when a user <em>specifically</em> chooses to track an Achievement</li>\n<li><strong>Unlocked</strong>: An Unlocked Achievement pointing to 0 or more Verification objects, the User who unlocked it and the Achievement</li>\n</ul>\n<p>... and as for Objectives, an Objective can become <em>In Progress</em> once a user has started completing it. If it's an action that must be completed 20 times, every unlock of that Objective will be 5% towards its completeness. If the objective is to visit a location once, that one time will be 100% towards its completion and the progress will be set to complete.</p>\n<p>And, of course, an Achievement has a <em>Category</em>, <em>Mode</em>, <em>Type</em>; these are important for the points. To represent the Achievement, it has an <em>Icon</em>, and a link to the user who created it.</p>\n<hr>\n<h2 id=\"are-you-planning-on-monetizing-this-and-if-so-how\"><a href=\"#are-you-planning-on-monetizing-this-and-if-so-how\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Are you planning on monetizing this, and if so, how?</h2>\n<p>I don't want to monetize this but it may turn out that we'll have to, to be able to sustain the costs. It's important to me that we then keep in mind that life is for everyone, and you shouldn't have to pay for this. Maybe let an ad-free version of the app cost $1 or something.</p>\n<p>Another idea is to let companies purchase visibility on the site in a <em>non-intrusive</em> way. For example, imagine you have an Achievement for Sky-Diving. We could then pull out nearby organizations that could help you complete this Achievement, which would be more of a help to users than it would be a burden with ads.</p>\n<h2 id=\"so-whats-done-and-what-needs-to-be-done\"><a href=\"#so-whats-done-and-what-needs-to-be-done\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>So, what's done and what needs to be done?</h2>\n<p>Basically the whole back-end is done, and the API for the app to communicate with is done as well. The website needs some finishing touches, but is also nearing completion.</p>\n<p>Icons for Achievements and actions, lists and a logo are also things needed. Preferably a better website design as well - I'm a coder, not a designer, unfortunately :(</p>\n<p>If you would like to help out with Windows Phone, iOS, or Android development -- or graphics! -- don't hesitate to contact me :)</p>","fields":{"slug":"aeventyr"},"frontmatter":{"title":"Æventyr","date":"14.09.2019","category":"Projects","tags":["Technology","Coding"],"banner":"/projects/eventyr/banner.jpg"},"timeToRead":9}},"pageContext":{"slug":"aeventyr","prev":{"excerpt":"I'm an avid runner, and I run on most days of the week - but recently I've realized that as I go further and further, my knee begins to ache around the 11-12km mark. After doing some research of my own, I came to realize that as my job is a sedentary…","html":"<p>I'm an avid runner, and I run on most days of the week - but recently I've realized that as I go further and further, my knee begins to ache around the 11-12km mark. After doing some research of my own, I came to realize that as my job is a sedentary one, and for most of my life I've been spending a big part of the day sitting down, this may have lead to my quadriceps being rather weak, and leading to bad running form.</p>\n<p>Although running form may be decent for the first part of a long run, as my muscles get tired, they weaken and my legs begin to get angled inward, putting a lot of weight on my knees. Practicing good form is of course a virtal part of running, but I began to wonder if perhaps weakness in my thighs and hips were making that more difficult than it needs to be.</p>\n<p>A couple of years ago I came across the weight lifting program I've enjoyed the most so far: Greyskull LP. It allowed me to see quick results, and focus on compound lifts. That said, I've also tried other popular exercise regiments like <em>AllPro</em>, but Greyskull were the one I liked the most. Everytime I've gotten started with Greyskull LP again, I've re-used my aging Excel / GDocs spreadsheet (often printed out).</p>\n<p>When I started looking for an app to replace the spreadsheet, I found only one made specifically for GSLP, and I found it to be more lacking in both design and functionality than my spreadsheet was. I realized I could probably make an app that just re-implements my spreadsheet but with a nicer design, and add whatever features I felt couldn't be accomplished by the spreadsheet — so I set out to create an app just like that.</p>\n<p>Having originally hoped it would take less than a weekend of work, I ended up in a rabbit hole of both restructuring code (from originally using Apollo with link-state-local, to using a redux style architecture with the new <code class=\"language-text\">React.Context</code> API).</p>\n<p>Now the app is more or less finished and although it was originally intended only for me, I thought perhaps other people would like the same app, and decided to publish it on the app store: This is the first app I've actually finished and published!</p>","id":"54024f8a-1b6f-510e-8508-532980c14459","fields":{"slug":"gslp"},"frontmatter":{"date":"2019-02-02","title":"GSLP","category":"Projects","icon":"/projects/gslp/icon.png","tags":["Technology","Coding"],"banner":"/assets/gslp.jpg"},"timeToRead":2},"next":null}}